'''
Аналіз тексту: Програма запитує рядок тексту і рахує кількість голосних та приголосних літер.
'''


text = 'Сонце світить. Сонце гріє. Люди радіють сонцю.'

punctuation_list = [
    '!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/',
    ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`', '{', '|', '}', '~',
    '«', '»', '„', '“', '”', '…',
    '—', '–',  # різні тире
    '·', '•', '✔︎', '★', '☆', '✓'
]

for i in range(len(punctuation_list)):
    text = text.replace(punctuation_list[i], '')

text = text.lower()

print(text)

