from kivy.app import App                    # Базовий клас для створення додатку
from kivy.uix.label import Label            # Елемент інтерфейсу - напис (текстовий ярлик)

# Створюємо власний клас додатку, який успадковується від базового класу App
class MyApp(App):
    # Метод build() створює та повертає головний віджет (елемент), який буде показаний на екрані
    def build(self):
        # Створюємо об'єкт Label з текстом "Привіт, світ!"
        return Label(text='Привіт, світ!')

# Цей блок перевіряє, чи цей файл запущено напряму, а не імпортовано
if __name__ == '__main__':
    # Створюємо екземпляр додатку та запускаємо його
    MyApp().run()