
for i in range(10): #range(старт, стоп, крок)  крок -1 це зворотний відлік
	print(i)
	
	
	числа = [10, 20, 30, 40, 50]

for число in числа:
    if число >= 40:
        break
    print(f"Число: {число}")
    
    
for число in числа:
    if число == 40:
       continue
    print(f"Число: {число}")
    
    
фільтровані = filter(lambda x: x >= 40, числа)
for число in фільтровані:
    print(число)
    
        
for число in [x for x in числа if x >= 40]:
    print(число)


фрукти = ["яблуко", "банан", "груша"]
for фрукт in фрукти:
    print(f"Я люблю {фрукт}")