# Введення користувача
введення = input("Введіть слова і числа через пробіл: ")

# Розбиваємо на частини
елементи = введення.split()

# Створюємо окремі списки
слова = []
числа = []

# Перебираємо елементи і розділяємо
for елемент in елементи:
    if елемент.replace('.', '', 1).isdigit():
        # replace('.','',1) міняє першу точку на пустоту
       
        числа.append(float(елемент))
    else:
        слова.append(елемент)

# Виводимо результат
print("Слова:")
for слово in слова:
    print(слово)

print("\nЧисла:")
for число in числа:
    print(число)