# типи незмінних об'єктів
#=========================

# str        'hello'     # строка
str.replace("9", "8") # замінює в строці всі цифри 9 на 8
str[::-1]  # перевертає всю строчку задом наперед

# bool       True        # логічний тип

# int 10  # Числовий тип

# float      3.14        # число з плаваючою комою
# tuple                  # кортеж
# NoneType               # нічого

# типи змінних об'єктів
#=========================

# list [1, 2, 3] # список
list.append(4)  # додає в кінець
list.insert(1, 99) # вставляє 99 на 1 позицію
list.extend([4, 5]) # додає в кінець 4 і 5
list +=[4, 5]   # додає в кінець 4 і 5
list.clear() # очищає список
list.copy() # додає копію списку
a = 'text'
b = list(a) # розділя є текст на символи в списку
' ' .join(list) # обєднує елементи в списку, ' ' - роздільник між цими елементами

list[:3]  # виведе 3 перших
list[-3:]  # виведе 3 останніх
len(list) # вивести кількість елементів

list = mlist[0::2]  # починаємо з 0-го елемента, вибираємо кожен елемент з кроком 2

#set  # список з унікальними об'ктами

#dict {'min' : 5, 'max' : 10}  # словник

# complex  3 + 5j  # комплексний тип данх

# Способи приствоєння значень

a = "Hello"
b = 10
c = "20"

a,b,c = 10,"hello", 7.875
d = e = f = 25
